addons/binding/org.openhab.binding.ihc.test/src/test/resources/ResourceValueUpdate200002.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
 <soap:Body>
  <setResourceValue1 xmlns="utcs">
   <value xmlns:q1="utcs.values" xsi:type="q1:WSFloatingPointValue">
    <q1:maximumValue>1000.0</q1:maximumValue>
    <q1:minimumValue>-1000.0</q1:minimumValue>
    <q1:floatingPointValue>24.1</q1:floatingPointValue>
   </value>
   <resourceID>200002</resourceID>
   <isValueRuntime>true</isValueRuntime>
  </setResourceValue1>
 </soap:Body>
</soap:Envelope>